app/controllers/collection_controller.rb

  def index
    @collections=Collection.all
---
SELECT `collections`.* FROM `collections`

  def show
    @collection=Collection.find(params[:id])
---
SELECT  `collections`.* FROM `collections` WHERE `collections`.`id` = 1 LIMIT 1